{
    "active": [
        {
            "name": "东胜神洲之旅：从废墟上重塑新生",
            "desc": [
                "{第1章：病魔缠身：孙悟空刚从魔鬼的战斗中恢复过来，他近乎虚弱到无法行动，他的法力全部消失。这是一场与生命做斗争的战斗}",
                "{第2章：合力前行：在唐僧的帮助下，孙悟空开始前往东胜神洲的艰难旅程。这是一段充满困难和考验的旅程，但他们凭借坚定的决心和友情，一路向前。}",
                "{第3章：女娲的遗物：东胜神洲，他们找到了当年女娲补天留下来的灵石。这块灵石充满了未知的力量，为他们的旅程带来了一线希望。}",
                "{第4章：山神的考验：然而，要获取这块灵石并不容易。他们必须面对山神的考验，孙悟空更是身心皆受煎熬。}",
                "{第5章：历练的果实：经过一次次的挑战和历练，孙悟空逐渐恢复了法力，只是这次他的力量更加真实，源自内心的强大。}",
                "{第6章：重塑新生：经过这一段旅程，孙悟空从心理和身体上都得到了新生。他的目光变得更加坚定，身躯也倍感强大，他已经准备好迎接接下来的一切挑战。}",
                "胜利结束语：“孙悟空，你的决心和毅力让你成功的走过了这段历程，从中你成长了，变得更加强大。这是你自己的胜利，你的新生，你的重新开始！”",
                "失败结束语：“孙悟空，虽然你没有在这次挑战中成功，但是你展现出的决心和坚韧让我们看到了你的希望。请你记住一点，只有你有决心，无论何时，成功都会在前方等待你。”"
            ],
            "bonus": 2253.0488807689358,
            "goal": 6,
            "cost": 600.0,
            "progress": 0,
            "start_time": "2024-03-15T22:00:00",
            "duration": 210.0,
            "failed": false
        }
    ],
    "finished": [
        {
            "name": "1",
            "desc": "1",
            "bonus": 45.0,
            "goal": 1,
            "cost": 10.0,
            "progress": 1,
            "start_time": "2023-12-26T19:44:29.877910",
            "duration": 1.0,
            "failed": true
        },
        {
            "name": "19点前 la算法x2番",
            "desc": "第一个挑战",
            "bonus": 322.10827868441703,
            "goal": 2,
            "cost": 60.0,
            "progress": 1,
            "start_time": "2024-02-04T18:20:00.293437",
            "duration": 1.0,
            "failed": true
        },
        {
            "name": "勇士的试炼",
            "desc": "A randomly generated challenge.",
            "bonus": 70.36328806315504,
            "goal": 2,
            "cost": 40.0,
            "progress": 0,
            "start_time": "2024-02-27T13:24:38.688065",
            "duration": 2.034452725444008,
            "failed": true
        },
        {
            "name": "追债计划",
            "desc": "将收益快速赚为正数",
            "bonus": 256.84951231003845,
            "goal": 4,
            "cost": 100.0,
            "progress": 4,
            "start_time": "2024-02-27T16:12:57.073448",
            "duration": 2.5,
            "failed": false
        },
        {
            "name": "两番茄速成",
            "desc": "",
            "bonus": 328.593609458054,
            "goal": 2,
            "cost": 100.0,
            "progress": 2,
            "start_time": "2024-02-27T19:04:21.518915",
            "duration": 1.0,
            "failed": false
        },
        {
            "name": "2.28面前冲刺",
            "desc": "冲鸭",
            "bonus": 405.6718485261867,
            "goal": 2,
            "cost": 100.0,
            "progress": 1,
            "start_time": "2024-02-28T12:05:15.058756",
            "duration": 1.0,
            "failed": true
        },
        {
            "name": "梁山大劫",
            "desc": "任务描述：你作为阮小二，从村民口中得知严家庄的镖车将要送去梁山的珍贵物资，恰好梁山正需要这些物资以抵御未来可能的攻击。你的任务是获取镖车行进路线的详细信息，制定一个完美的抢劫计划。",
            "bonus": 859.7067569778739,
            "goal": 4,
            "cost": 200.0,
            "progress": 2,
            "start_time": "2024-02-28T15:03:23.258659",
            "duration": 2.0,
            "failed": true
        },
        {
            "name": "拜师之路：孙悟空的挑战",
            "desc": [
                "{第1章：野心的觉醒： 遗落在花果山的孙悟空，通过与山中诸兽的交锋，逐渐觉醒了学艺的野心和对外界的好奇。他决定开始寻找能够指导他的师父。探索湖泊，山脉，野生动物和人类的住所，收集线索，找到一条通往大师的道路。}",
                "{第2章：长途跋涉： 孙悟空跋山涉水，通过锁定地点，战胜怪兽，解谜，最终找到一条通向高山洞穴的道路，并坚信那里定有他要找的人。在这个章节中，孙悟空需要克服各种困难，保护自己，同时积累经验，提高自己的实力。}",
                "{第3章：智斗猴王： 高山洞穴的主人——猴王不轻易收徒，他设置了一系列的挑战等待着孙悟空。孙悟空需要通过智谋和力量，逐一击败猴王的挑战，证明自己有成为他弟子的资格。这是一个测试玩家战斗策略和解谜能力的好机会。}",
                "{第4章：终极考验： 孙悟空成功挑战了猴王，但最后的考验还未结束。猴王让悟空寻找一种神奇的草药，这种草药的位置只有通过解读一篇古老的卷轴才能找到。孙悟空需要利用他的智慧和力量，找到这种草药，才能最终成为猴王的弟子。}",
                "结束语：恭喜你完成了所有任务，孙悟空终于成为猴王的弟子，开始了他的弟子生涯。这只是孙悟空的冒险旅程的开始，他将在猴王的指导下，逐渐成长为一名真正的英雄。"
            ],
            "bonus": 763.9558858639059,
            "goal": 4,
            "cost": 200.0,
            "progress": 4,
            "start_time": "2024-02-29T17:11:29.629872",
            "duration": 2.1,
            "failed": false
        },
        {
            "name": "道法自然：孙悟空的习艺之旅",
            "desc": [
                "{第1章：寻找菩提老祖：在猴王的启发下，孙悟空想要学习更多的知识和技能，他听闻东胜神洲有一位高人菩提老祖，知道许多神奇的道法。孙悟空踏上寻找菩提老祖的旅程，经历千辛万苦，终于找到了菩提老祖的住处。}",
                "{第2章：菩提老祖的试炼：菩提老祖并不轻易收徒，孙悟空想要成为他的弟子，需要通过一连串的试炼笔试以及实战测试，证明自己有足够的天赋和恒心。章节中，玩家将帮助孙悟空通过各种形式的挑战，不断突破自己，拨开迷雾，找到前行的路标。}",
                "{第3章：学习72变：孙悟空成功打动了菩提老祖，被接纳为弟子，开始学习72变的道法。每一变都需要孙悟空克服不同的困难，找到解决问题的策略，你将在这个过程中，帮助孙悟空将这门深奥的道法学到了心中。}",
                "{第4章：猎妖之战：在学习完72变后，孙悟空被菩提老祖派去斩妖降魔，以此来证明自己的实力和成长。在这个章节中，孙悟空将遇到各种凶猛的妖怪，你需要用你刚刚学到的技能，帮助孙悟空完成任务，证明自己的价值。}",
                "结束语：恭喜你成功完成了所有的任务，孙悟空经过一段长时间的磨砺，他已经掌握了72变的各种技巧，他将带着这些技巧，继续他的传奇旅程。你的帮助让他在这个过程中变得更加强大，“道法自然”不再是一个空洞的名词，而是他用行动实现的信仰。"
            ],
            "bonus": 601.2945045362295,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-01T12:43:56.006498",
            "duration": 2.0,
            "failed": true
        },
        {
            "name": "从大闹天宫到五花山，孙悟空的挑战",
            "desc": [
                "{第1章：大闹天宫：在这一章节中，您将扮演孙悟空，大闹天宫，与天兵天将进行激战。你需要通过策略和技巧，来对抗大量的敌人，并取得胜利。}",
                "{第2章：入佛教之门：在收朝天兵天将之后，你需要扮演孙悟空求佛入道。这会涉及到与观世音菩萨和如来佛祖的对话，并使他们相信你的忠诚。}",
                "{第3章：被罚下界：在这部分任务里，你的行为引发了如来佛祖的不满，你需要尝试逃脱，但无论你做什么，剧情最后都会被罚到人间。}",
                "{第4章：五花山困难：陷入困境后，你作为孙悟空需要尽可能长时间地在五花山挺过去。你需要利用你的技能和资源在这个环境中生存，直到被唐僧解救。}",
                "胜利结束语：恭喜你，琢磨出如来佛祖的试炼，孙悟空在挑战中无所畏惧，展示出了他的无畏和勇敢。你现在已经准备好了开始西游记的大冒险。",
                "失败结束语：你没有成功完成孙悟空的挑战。无论你现在是否感到沮丧，记住不要放弃。因为每一个困难只会使你变得更加强大。请再次尝试，并用你的能力克服每一个挑战。你就是孙悟空，你有能力做到。"
            ],
            "bonus": 643.3613505657023,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-01T15:46:48.156013",
            "duration": 2.1,
            "failed": true
        },
        {
            "name": "揭秘阎王的阴谋",
            "desc": [
                "{第1章：下地府：作为孙悟空，你在上一个任务失败后被贬到了地府。在这一章里，你需要尽快适应这个陌生的环境，并寻找信息，以了解这个新的挑战。}",
                "{第2章：发现阴谋：在这个章节中，你要调查阎王的计划，探寻他的阴谋力量。你需要小心地搜集线索，并通过智谋和策略找到隐藏的真相。}",
                "{第3章：揭露阎王：在最后一章节，你需要针对阎王阴谋的证据，将阎王的阴谋公之于众，并挫败他的计划。好好利用你的智慧和力量，以防止阎王对地府的进一步损害。}",
                "胜利结束语：恭喜你成功揭秘了阎王的阴谋并挫败了他的计划。你的勇气和智慧展示出真正的英雄。孙悟空再次彰显出他的无畏精神和聪明才智。",
                "失败结束语：虽然你未能揭秘阎王的阴谋，但是请别灰心。记住，我们通过失败学习，通过挑战变得更强。重新来过吧，你有慧眼识破一切，有力量征服一切，你就是孙悟空。再次挑战这个剧情任务，期待你的胜利！"
            ],
            "bonus": 621.1224069325889,
            "goal": 3,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-01T18:38:47.683990",
            "duration": 1.5,
            "failed": false
        },
        {
            "name": "召回人间，孙悟空的唐僧招募之旅",
            "desc": [
                "{第1章：召回人间：你成功揭秘了阎王的阴谋并被召回到人间。作为孙悟空，你需要快速适应重新回到世界，并开始你的新旅程。}",
                "{第2章：寻找唐僧：在这个章节中，你需要找到即将出山的唐僧。利用你的聪明才智和力量，通过询问当地居民，解决谜题，并避开遇到的陷阱来寻找他。}",
                "{第3章：请唐僧出山：在此章节，你需要说服唐僧和他的徒弟们出山，开始新的冒险。展现你的智慧和说服力，让他们相信你，为接下来的取经之旅做准备。}",
                "{第4章：开始取经旅行：唐僧同意出山后，你需要为西天取经之旅做好准备。收集必要的物品，且要确保全队人员的状态良好，预备迎接可能遇到的一切困难。}",
                "胜利结束语：恭喜你成功的找到了唐僧并开始了西天取经的旅行，孙悟空的冒险又进入了新的篇章。等待您的，将是更多未知的挑战，艰难的试炼，以及无尽的冒险。期待你在未来的旅程中继续展现智慧和勇气。",
                "失败结束语：你没能成功说服唐僧出山或者开始取经的旅行，但别气馁，失败总是成功之母。你是孙悟空，你从不知道怎么样是放弃。让我们再次挑战这个剧情任务，期待你的胜利！"
            ],
            "bonus": 766.8099217183552,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-02T17:16:32.482146",
            "duration": 2.1,
            "failed": true
        },
        {
            "name": "唤醒唐僧，孙悟空的不按常规出牌之计",
            "desc": [
                "{第1章：寻找唐僧：你作为孙悟空，虽然未能成功说服唐僧出山，但你决定了新的行动方案。你需要锲而不舍的寻找唐僧，在找到他的同时要避免引起过多的注意，以防敌人知道你的计划。}",
                "{第2章：逼迫唐僧出山：无法通过普通方法说服唐僧，你决定用武力逼迫唐僧出山。你要威慑大僧出山，并以力量保证他的安全，同时你要确保你的力量不会伤及无辜。}",
                "胜利结束语：恭喜你用武力成功的逼迫唐僧出山并开启新的旅程。虽然这个决定有些冒险，但你的勇气和决心向我们展示了一个不同于以往的孙悟空。",
                "失败结束语：这次尝试未能成功，你的力量或许过大，或者你的策略有待改进。记住，孙悟空从未怕过失败。让我们再次尝试这个任务，期待你的胜利！"
            ],
            "bonus": 409.646675432181,
            "goal": 2,
            "cost": 100.0,
            "progress": 2,
            "start_time": "2024-03-02T19:56:44.080964",
            "duration": 1.0,
            "failed": false
        },
        {
            "name": "绝地归来，唐僧师徒的收复八戒之旅",
            "desc": [
                "{第1章：唐僧出山：经过了前期的决斗，你成功地逼出了唐僧，并开始了新的西天取经之旅。你需要确保唐僧的安全，同时积极寻找其他合适的人选加入你们的行列。}",
                "{第2章：寻找八戒：在这一章节中，你得知八戒可能在附近，你需要从当地居民那里获取线索，根据线索搜寻八戒，以便重建你们的团队。}",
                "{第3章：战斗与劝说：找到八戒后，你发现他已经被妖怪控制，为了收复他，你需要展现出你的武力，并在深入的战斗中救出八戒。战斗结束后，需要用你的智慧说服他重新加入你们的队伍。}",
                "{第4章：重组团队：在收复八戒后，你们就准备继续取经之旅。这一章节需要你确保唐僧师徒的状态良好，处理可能出现的问题，并最终准备好继续前行。此时的队伍已经变得更加强大，将面临新的挑战。}",
                "胜利结束语：恭喜你成功收复了八戒，你的队伍变得更强大，这标志着你们的取经之路已经迈出了新的一步。接下来的旅程中，相信你们会面对更多的挑战，期待你们一步步克服困难，成功完成取经之旅！",
                "失败结束语：哎呀，看来这次你没有成功收复八戒。但别担心，失败并不可怕，孙悟空从不知道滑倒两次，三次是什么感觉。让我们再次尝试这个任务，期待你的胜利！"
            ],
            "bonus": 748.3688735537712,
            "goal": 4,
            "cost": 200.0,
            "progress": 4,
            "start_time": "2024-03-05T14:18:12.688989",
            "duration": 2.2,
            "failed": false
        },
        {
            "name": "流沙纵横，唐僧师徒收复沙僧之旅",
            "desc": [
                "{第1章：继续取经旅行：你作为孙悟空，和唐僧以及猪八戒成功重组队伍后，你们决定继续西天取经之旅，大家精神饱满，充满了希望和信心。}",
                "{第2章：发现流沙河：在你们的旅行过程中，发现了一片流沙河，而沙河中似乎隐藏着某种未知的力量。在这一章节中，你需要发挥聪明才智以观察和了解这股力量。}",
                "{第3章：战斗并收复沙僧：在流沙河中，你遇见了沙僧。你需要通过智勇双全的战斗迫使他屈服，并最终说服他加入你们的团队。}",
                "{第4章：继续取经：在成功收复沙僧后，你们的队伍再度壮大。这一章节，你需要保护好队伍的每一个成员，处理可能出现的问题，并做好准备继续西天取经之旅。}",
                "胜利结束语：恭喜你成功收复了沙僧，你的取经队伍已经成型，期待你们团结一致，共同面对接下来的挑战，完成取经之旅！",
                "失败结束语：哦，看来这次收复沙僧的尝试并未成功，但请记住，失败是成功之母。你是孙悟空，你懂得如何从挫折中站起来。让我们再尝试一次，期待你下一次的胜利！"
            ],
            "bonus": 725.2548691829818,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-05T17:17:10.097891",
            "duration": 2.2,
            "failed": true
        },
        {
            "name": "险象环生，唐僧师徒与魔化沙僧的决战",
            "desc": [
                "{第1章：发现魔化沙僧：你作为孙悟空，正在与师兄弟们踏上取经之旅。在旅行的途中，你发现沙僧的举动突然变得古怪，他的样貌也开始变化。你必须查明原因，并挖掘真相。}",
                "{第2章：了解妖魔化过程：你积极寻找线索，了解沙僧被妖魔化的原因，同时你还要防止他的行径对取经之旅产生更大的影响。 }",
                "{第3章：决战魔化沙僧：你决定要结束沙僧的妖魔化状态。你必须用你的智慧与实力与魔化的沙僧展开决战，并最终将其打入轮回地狱。}",
                "{第4章：重启取经：在成功击败魔化沙僧后，你需要处理队伍中的其他问题，并准备好再一次出发，继续你们的西天取经之旅。}",
                "胜利结束语：恭喜你成功击败了魔化的沙僧，并将其打入轮回地狱。你的勇气和智慧务必能帮助你们在未来的旅程中再次度过难关。期待你们下一步的成功！",
                "失败结束语：哎，看来这次你并未能成功逐退魔化的沙僧。但是，请别气馁。失败也是一个学习的过程，让我们从中吸取教训，再次挑战。孙悟空，你是我们最强大的战士，你一定能胜利！"
            ],
            "bonus": 899.1461219933434,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-06T13:48:33.183186",
            "duration": 2.1666666666666665,
            "failed": true
        },
        {
            "name": "复仇之战，归来的沙僧与花果山之战",
            "desc": [
                "{第1章：沙僧的变化：在你们的取经之旅中，时隔多日，你再次遇见了沙僧，他的眼神充满了怒火，表现出强烈的恶意。你需要找出他行为突变的原因，并尽快解决。}",
                "{第2章：发现真相：你了解到沙僧已经决定去花果山复仇。你需要收集信息，找到他的下一步行动，并且想办法阻止他的复仇计划。}",
                "{第3章：与沙僧的决战：你必须面对沙僧，他已经步入了复仇的道路并决心实现其目的。所以，你必须用你所有的力量与他展开一场决战，阻止他的复仇行动。}",
                "{第4章：再次起航：在成功阻止沙僧的复仇行动后，你需要处理队伍中的其他问题，准备好再一次出发，继续取经之旅。}",
                "胜利结束语：恭喜你成功阻止了沙僧的复仇行动，让花果山免于一场大劫。你的智勇使你对未来的困难有了更多的信心。让我们继续目标，期待你们的取经之旅更多的成功！",
                "失败结束语：很遗憾，你没有成功阻止沙僧，他的复仇带来了大祸。但是请不要放弃，失败只是暂时的。请集中精力，重新来过，用你的勇气和智慧去正面面对这一切。孙悟空，你是强者，你一定可以的！"
            ],
            "bonus": 667.7569317038766,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-06T16:36:08.050358",
            "duration": 2.1666666666666665,
            "failed": true
        },
        {
            "name": "从灰烬中崛起，花果山的灾难与沙僧的封印",
            "desc": [
                "{第1章：目睹灾难：你作为孙悟空，回到被毁灭的花果山，你需要在混乱中找出导致灾难的真相，同时保护好自己和猪八戒。}",
                "{第2章：追踪沙僧：发现沙僧是此次灾难的始作俑者后，你决定展开追踪，查明他的下一步行动，并寻找封印他的方法。}",
                "{第3章：制服沙僧：和猪八戒合力，你们需要联手击败失控的沙僧。你们必须运用各自的能力制服他，阻止他的破坏行动。}",
                "{第4章：封印沙僧：你们成功制服沙僧后，需要找到一种方法将他封印起来，以防止他再次引发灾难。封印沙僧后，你们可以开始计划重建花果山。}",
                "胜利结束语：恭喜你们成功制服并封印了沙僧，等待你们的将是重建家园的艰巨任务。你们通过这场灾难看清了真相，用勇气和智慧应对困难。期待你们在重建家园的道路上获得更大的成功！",
                "失败结束语：哦，这次封印沙僧的计划失败了，恐怕你们还需要面对更多的困难。但是，请不要绝望，无论前方的路多么艰难，你们都有面对它的勇气和智慧。失败只会让你更加坚强，正视失败，并从中吸取教训，重整旗鼓，再接再厉，你们一定可以！"
            ],
            "bonus": 955.0059504302703,
            "goal": 3,
            "cost": 200.0,
            "progress": 0,
            "start_time": "2024-03-06T23:00:00",
            "duration": 1.5,
            "failed": true
        },
        {
            "name": "为正义而战，观音菩萨援手收服沙僧",
            "desc": [
                "{第1章：邪恶的觉醒：你作为孙悟空，亲眼看到沙僧变得更加强大，他的邪恶气息让你们深感无力。你们需要迅速变得更强，挺身对抗邪恶。}",
                "{第2章：寻求援助：知道你们联手也无法与沙僧抗衡，你决定寻求观音菩萨的援助。你需要越过各种阻碍，才能找到观音菩萨，并向她说明情况。}",
                "{第3章：联合观音菩萨：在观音菩萨的援助下，你们需要与沙僧展开又一轮决战。你们需要全力以赴，才有可能将他压制。}",
                "{第4章：收服沙僧：在观音菩萨的帮助下成功地压制住了沙僧，而接下来你们需要寻找方法，收服他，使他回归正道，以防止他再次掀起波澜。}",
                "胜利结束语：恭喜你们！在观音菩萨的帮助下成功收服了沙僧，将这场可能带来更大灾难的风波平息下来。这个挑战无疑是重重难关中的一大步，你们的勇气和智慧将是你们对抗任何难题的利器。期待你们在取经之路上取得更多的成功！",
                "失败结束语：遗憾的是，你们并未能成功收服沙僧，他仍然在制造更多的混乱和破坏。但请不要绝望，你们仍然有机会重新挑战他。失败只是成功的垫脚石，你们将再次挺身而出，以你们的智慧和勇气去收服他，你们一定可以做到！加油！"
            ],
            "bonus": 1120.9573485558635,
            "goal": 4,
            "cost": 300.0,
            "progress": 4,
            "start_time": "2024-03-07T10:40:00",
            "duration": 140,
            "failed": false
        },
        {
            "name": "重建家园，蓝翔援手花果山",
            "desc": [
                "{第1章：在复仇风暴中的胜利：在与沙僧的决战结束后，你成功阻止了他的复仇行动，花果山虽然遭遇了损失，但你赢得了胜利。这一章是庆祝这个伟大胜利的时刻，你需要激励你的队伍，并确定下一步行动。}",
                "{第2章：确定重建之路：面对花果山的重建问题，你决定寻求蓝翔帮助。这一章，你需要了解和确定寻求帮助的策略，并准备好向蓝翔发出请求。}",
                "{第3章：走向蓝翔：你走向蓝翔，用你所有的说服力去请求他们的帮助。这一章，你需要面对可能的问题，解决他们对你的疑虑，并拉近与他们的关系。}",
                "{第4章：成功的喜讯：你成功地说服了蓝翔，他们决定帮助花果山重建。这是庆祝的时刻，你需要传达这个好消息，并策划一次庆祝活动。}",
                "胜利结束语：恭喜你，你成功的说服了蓝翔，现在他们将帮助花果山的重建。你的智慧和决心在这次挑战中得到了体现，期待你在未来的任务中取得更多的成功。让我们共同参加庆祝活动，欢庆花果山的新生！",
                "失败结束语：这次你并没有成功地说服蓝翔，但请不要失望。每个挑战都是一个学习的机会。通过这次经历，你更清楚如何改善你的策略。面对挑战，孙悟空，你总是可以以你无人能敌的决心和勇气去击败困难，期待你的精彩的表现！"
            ],
            "bonus": 969.7704177200569,
            "goal": 4,
            "cost": 300.0,
            "progress": 4,
            "start_time": "2024-03-07T15:06:29.593835",
            "duration": 137.0,
            "failed": false
        },
        {
            "name": "新友同行，白龙马的归来",
            "desc": [
                "{第1章：狂欢过后：在成功地寻求到蓝翔的帮助并庆祝过后，你和你的队伍处于一个欢乐而短暂的狂欢之中。然而，你们知道你们还需要继续旅程，因此你们开始为下一次的行程做准备。}",
                "{第2章：迎接新挑战：你们决定找到一只坐骑，为唐僧的旅程提供便利。你们的目标是神奇的白龙马。为了这一个目标，你们必须策划并执行一次捕获白龙马的任务。}",
                "{第3章：与白龙马的交流：你们找到了白龙马，但是不是所有的事情都如预期的那样顺利。你们需要和白龙马进行交流，承认你们的目的，并尽力说服它和你们同行。}",
                "{第4章：新的起点：你们成功地说服了白龙马，和它建立起了深厚的友谊。现在，有了这个新的伙伴，你们再度出发，准备应对下一次的挑战。}",
                "胜利结束语：恭喜你，孙悟空！你成功地说服了白龙马成为你们的新伙伴。这只增加了你们取经队伍的实力。有了白龙马的帮助，你们将能更快地完成任务。我们期待你们在未来的旅程中取得更多的胜利。",
                "失败结束语：你并没有成功说服白龙马加入你们的队伍，但这并不重要。失败只是成功的教父，你一定能从这次经历中找到成功的线索。相信你自己，孙悟空，你一定能找到自己的道路。让我们一起为你的下一次成功尝试欢呼！"
            ],
            "bonus": 858.2936636466493,
            "goal": 4,
            "cost": 300.0,
            "progress": 3,
            "start_time": "2024-03-07T18:40:35.497850",
            "duration": 130.0,
            "failed": true
        },
        {
            "name": "223",
            "desc": [
                "1",
                "1"
            ],
            "bonus": 891.3532775668912,
            "goal": 4,
            "cost": 300.0,
            "progress": 0,
            "start_time": "2024-03-07T22:00:00",
            "duration": 150.0,
            "failed": true
        },
        {
            "name": "黑化冲突，白龙马之暗黑化身",
            "desc": [
                "{第1章：暗影崛起：在试图说服白龙马加入你们的过程中，一些意想不到的事情发生了，白龙马变得十分强大和敌对。你需要赶快找出原因，对付这个突如其来的威胁。}",
                "{第2章：找寻黑暗之源：你开始寻找导致白龙马黑化的原因，并设法找到解决的途径。在这一章，你需要收集信息，揭示白龙马黑化的真相。}",
                "{第3章：进入龙宫：你了解到白龙马黑化的原因是因为它的大脑被龙宫的邪恶力量污染。你需要进入龙宫，找出污染的源头，并摧毁它。}",
                "{第4章：决战黑化之源：在龙宫深处，你找到了污染白龙马的邪恶力量源头，你需要面对这个强大的敌人，用你所有的力量战胜它，解放白龙马，使它回归原状。}",
                "胜利结束语：赞美你的英勇，孙悟空！尽管面临强大的敌人，你成功地摧毁了邪恶的力量源头，解放了白龙马，成功地结束了这次危机。你的英勇和智慧使你在这次挑战中得以成功，我们相信你在未来的任务中也会取得更多的胜利。",
                "失败结束语：虽然你没有成功摧毁邪恶的力量源头，但你的勇敢和决心令人赞美。你在这次挑战中获得了宝贵的经验，我们知道你在未来的任务中一定能取得更大的胜利。加油，孙悟空，面对挑战，你一定能够挺过这场创伤，重返巅峰！"
            ],
            "bonus": 1190.4073898080042,
            "goal": 4,
            "cost": 300.0,
            "progress": 3,
            "start_time": "2024-03-09T13:34:05.986802",
            "duration": 130.0,
            "failed": true
        },
        {
            "name": "阴影笼罩，龙王陨落战斗乐起",
            "desc": [
                "{第1章：混乱的爆发：邪恶的源头成功地吞噬了白龙马，控制了它的身体并杀死了龙王。在这个混乱和危险的情况下，你必须清醒地思考，寻找解决问题的策略。}",
                "{第2章：设定战斗策略：你和唐僧开始制定对抗黑化白龙马的策略。你们明白这将是个艰巨的任务，所以你们需要大胆但又谨慎地执行你们的计划。}",
                "{第3章：不屈的斗争：清醒地理解到只有封印黑化的白龙马，才能阻止这场混乱，你和唐僧勇往直前，与黑化白龙马展开了激烈的战斗。尽管战斗艰苦，但你们决定一直持续到最后一刻。}",
                "{第4章：封印的胜利：在一场激烈的战斗后，你和唐僧成功地封印了黑化的白龙马，你们的决策和勇气使你们在此次严重危机中取得了重大胜利。暮色中，你们站立在龙宫里，凝视着被封印的白龙马，对自己的胜利微笑。}",
                "胜利结束语：在此次战斗中，你的英勇和智慧使得你成功地封印了黑化的白龙马，结束了一场可怕的混乱。你再度表现出了作为英雄的品质，我们都为你感到骄傲。你已经走出这场危机，继续上路，期待你在未来的任务中将取得更大的胜利！",
                "失败结束语：遗憾的是，你此次没有成功地封印黑化的白龙马，但请你不要感到绝望。在失败面前，真正的英雄总是保持坚定，从每一次失败中汲取教训，然后重新起航。请你心怀希望，持续前行，孙悟空，你的未来定将是充满光明的。"
            ],
            "bonus": 789.9579403708841,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-09T19:01:07.013013",
            "duration": 120.0,
            "failed": true
        },
        {
            "name": "洗礼的残醒，西天求援",
            "desc": [
                "{第1章：龙宫的遗址：你和唐僧在龙宫的废墟中醒来，周围是由黑化的白龙马制造的混乱和破坏的痕迹。你们两人决定，现在是时候去寻找帮助，去西天求援。}",
                "{第2章：寻找路径：你们开始寻找通往西天的路线。旅程中充满困难和危险，但你们需要坚持下去，毕竟只有西天的力量才能帮助你们制服黑化的白龙马。}",
                "{第3章：西天的考验：你们终于到达了西天，然而并非所有的问题都能简单解决。西天的神祗提出苛刻的挑战作为对你们提供帮助的交换条件。你们需要用智慧和勇气去面对这些挑战。}",
                "{第4章：援助的希望：经过不懈的奋斗和智慧的洞悉，你们成功完成了西天的考验，赢得神祗的信任。西天的力量将为你们提供帮助，以摧毁黑化的白龙马，从而结束这场恐怖的混乱。}",
                "胜利结束语：“胜利来之不易，孙悟空。接受祝贺，你已成功通过了西天的考验，赢得了他们的帮助。我知道你拥有在混乱中取得胜利的能力和智慧，我向你致以最高的敬意。期待你在未来的工作中可以使用这种力量来克服更多的困难，赢取更多的胜利。",
                "失败结束语：“即使你未能成功通过西天的考验，也不应自责或失去信心。真正的英雄是那些无论落败与否，都坚持向前的人。我肯定你具备这样的品质，孙悟空。”期待你在下一次任务中取得更大的胜利，去战胜黑化的白龙马，结束这场混乱。我对你充满信心，期待你在未来的挑战中显示出你的强大。"
            ],
            "bonus": 1417.1990794185976,
            "goal": 4,
            "cost": 300.0,
            "progress": 4,
            "start_time": "2024-03-10T13:25:42.517165",
            "duration": 130.0,
            "failed": false
        },
        {
            "name": "赎罪之路: 驯服并处决白龙马",
            "desc": [
                "{第1章：神器的力量：在西天的神们的帮助下，你获得了一个强大的神器。这个神器据说拥有驯服和消除邪恶的能力，你和唐僧需要使用它来制服黑化的白龙马。}",
                "{第2章：结束黑暗：你和唐僧决心使用神器制服并处决黑化的白龙马。在一场激烈的斗争中，你们成功地用神器将白龙马驯服。你们努力维持理智，最终做出了让白龙马付出代价的决定。你们以此结束了这场混乱，为大地带来了和平。}",
                "胜利结束语：祝贺你，孙悟空。尽管艰难，你成功地用神器收服并处决了黑化的白龙马。你的英勇和智慧使你在这次挑战中得以胜利，我们期待你在未来的任务中将取得更多的胜利。",
                "失败结束语：即使你未能成功地用神器收服并处决黑化的白龙马，我们仍对你充满尊敬，孙悟空。你关乎正义和和平的意志令人钦佩。你在这次任务中学到的宝贵经验将对你未来的挑战有所帮助，我们相信你一定能够走出困境，再次站上巅峰。"
            ],
            "bonus": 659.7206940205614,
            "goal": 2,
            "cost": 200.0,
            "progress": 2,
            "start_time": "2024-03-10T15:45:31.918266",
            "duration": 65.0,
            "failed": false
        },
        {
            "name": "生命的复苏：寻找那美克星的龙珠",
            "desc": [
                "{第1章：出发那美克星：功成名就后，你和唐僧决定前往那美克星，寻找传说中的龙珠，以复活那些在白龙马恶行下牺牲的龙宫居民。}",
                "{第2章：星际的旅行：你们乘坐飞船，穿越繁星点点的夜空，目标直指那美克星。然而，你们的飞船受到未知力量的干扰，旅程比预想的还要艰难。}",
                "{第3章：那美克星的考验：抵达那美克星后，你们开始寻找龙珠，但那美克星人对你们提出了一个挑战，只有通过这个挑战，你们才能获得龙珠。}",
                "{第4章：智慧与勇气：你和唐僧配合无间，凭借智慧和勇气，成功通过了那美克星人的挑战，获取了龙珠。}",
                "{第5章：生命的恢复：回到地球，你们使用龙珠，成功地复活了龙宫的居民。你们在此过程中展现的无私与勇气，让所有人都为之动容。}",
                "胜利结束语：孙悟空，祝贺你，你再一次赢得了胜利。你的勇气和智慧帮你解决了许多问题，即使面对困难，你也坚持到了最后。你用你的勇气和协作精神为那些失去生命的人带来希望，让他们得以再次看到光明。",
                "失败结束语：虽然你没有成功地复活龙宫的居民，但你已经尽力了。你在这个过程中表现出的无私和勇气是值得尊敬的。请你不要放弃，因为胜利总是属于那些永不放弃的人。你的未来定将是光明的，孙悟空。"
            ],
            "bonus": 1578.6524712708638,
            "goal": 5,
            "cost": 500.0,
            "progress": 4,
            "start_time": "2024-03-10T17:50:01.119644",
            "duration": 160.0,
            "failed": true
        },
        {
            "name": "亡魂的引导：消除人间的未知危害",
            "desc": [
                "{第1章：亡魂的吹散：完成前一任务后，你和唐僧发现龙宫的亡魂被吹散在各地。你们决定找到这些亡魂，并引导他们进入地府，避免他们影响人间世界。}",
                "{第2章：追踪亡魂：你和唐僧投入到这场寻找亡魂的追踪任务中。你们利用智慧和勇气，克服各种未知的困难，寻找散落的亡魂。}",
                "{第3章：引导之路：找到亡魂后，你们必须引导他们进入地府。这是一项艰巨的任务，你们需要再次展示你们的勇气和决心。}",
                "{第4章：结果的到来：经过艰苦的努力，你和唐僧成功地引导了所有亡魂进入地府，成功地保护了人间世界，结束了他们对人间的可能危害。}",
                "胜利结束语：“孙悟空，再次向你致敬。你以无比的力量和决心，成功地引导了亡魂进入地府，成功地保护了人间世界。希望你能继续用你的勇气和智慧来面对生活中的挑战，获取更多的胜利。”",
                "失败结束语：“孙悟空，即使这次任务并未成功，我们仍然为你的勇敢和决心感到骄傲。你在对抗亡魂的挑战中展示了你的真正力量，这是你无比珍贵的财富。我们相信你将在未来的挑战中再次崭露头角，获取胜利。”"
            ],
            "bonus": 1632.8681317362043,
            "goal": 4,
            "cost": 400.0,
            "progress": 0,
            "start_time": "2024-03-10T21:50:00",
            "duration": 140.0,
            "failed": true
        },
        {
            "name": "邪念浪潮：最终的对抗",
            "desc": [
                "{第1章：恶化的情况：在亡魂没有成功汇入地府后，他们聚集在一起，形成了巨大的邪念波，对人间造成了严重的威胁。你和唐僧决定剑走偏锋，用你们的智慧和勇气来进行最后的对抗。}",
                "{第2章：集结的力量：你们聚集一切来自西天众神的力量，采用了一种全新的策略，准备挑战邪念波。你们的团队影响力拉动了四周的能量，形成了一股强大的冲击力。}",
                "{第3章：困境的突破：你们释放集结起来的力量，强烈地冲击邪念波。在这场旷日持久的战斗中，你们不断调整策略，寻找邪念波的弱点，希望找到打败他们的办法。}",
                "{第4章：邪念的挑战：你们在这场战斗中激发出了从未有过的力量，攻击邪念波，尽管困难重重，你们都没有放弃。你们以坚定的决心，智慧与勇气迎向这场挑战。}",
                "{第5章：终极决战：在此消彼长的战斗中，你和唐僧最终找到了改变战局的办法，你们发起了最后的冲锋。邪念波在你们浑身解数的攻击下开始瓦解，最终战斗进入了最后的决定性阶段。}",
                "胜利结束语：“孙悟空，你无疑是一个极其勇敢和智慧的战士。在这场几乎无法抵挡的战斗中，你走到了最后，捍卫了你誓言守护的人间世界。我们向你致敬，祝贺你的胜利，期待你在未来的任务中取得更多的胜利。”",
                "失败结束语：“孙悟空，在面对这场艰巨的战斗时，你展现出了无比的勇气和决心，虽然结果不尽人意，但这并不能否定你的努力和付出。我们坚信，无论何时何地，你都有能力摆脱困境，重新开启胜利的旅程。”"
            ],
            "bonus": 1599.0036806867254,
            "goal": 5,
            "cost": 500.0,
            "progress": 3,
            "start_time": "2024-03-11T15:37:25.844717",
            "duration": 166.0,
            "failed": true
        },
        {
            "name": "自我挽救：从堕落中寻回真我",
            "desc": [
                "{第1章：堕落的初现：在与邪念波的战斗中，孙悟空不幸被邪恶气息所侵蚀，他的行为开始出现异常，你和唐僧决定应对这个新的挑战，帮助孙悟空恢复自我。}",
                "{第2章：自我应战：为了挽救孙悟空，你们让他进行了一系列的自我应战认知训练，帮助他理清混乱的思绪，找到逆转局势的可能。}",
                "{第3章：意志力的考验：孙悟空用最强的意志力对抗着邪恶气息的影响，他不断战胜自我，即便是在极度痛苦与困境中也始终坚持下去。}",
                "{第4章：挣扎中的复苏：孙悟空在你和唐僧的帮助下，开始在与邪念的对抗中渐渐设法恢复自我。他的堕落行为开始得到有效的控制，并逐渐向好的方向发展。}",
                "{第5章：胜利在望：最后，孙悟空震撼全场的强大意志力压制住了邪恶气息。他成功释放了内心的光明，战胜了自我，找回了自我，从邪念的影响中挣脱出来，并且开始用全新的状态，露出恢复的曙光。}",
                "{第6章：最终的归来：不断挣扎与战胜自我的孙悟空终于从堕落中完全恢复了过来。他用他无尽的勇气和坚定的意志力成功地抵抗了邪念的侵蚀，证明了他的强大和不屈不挠的精神。}",
                "胜利结束语：“孙悟空，你的勇敢与决心让我们都感到骄傲。你展示了无畏的精神，即使是在最艰难的时刻，你也从未放弃过。你的厮杀、你的挣扎、你的复苏，都让人深深地感到敬佩。你是我们所有人的英雄，祝贺你赢得了这场自我挽救的战斗。”",
                "失败结束语：“孙悟空，虽然你并没有完全摆脱邪念的侵蚀，但是我们都看到了你无比强大的意志和决心。你的努力并非毫无成果，你从未停止过挣扎，从未放弃过自我。请你继续保持这股精神，我们相信你最终会战胜一切。”"
            ],
            "bonus": 1927.8560496332104,
            "goal": 6,
            "cost": 600.0,
            "progress": 4,
            "start_time": "2024-03-12T16:15:00",
            "duration": 200.0,
            "failed": true
        },
        {
            "name": "自我挽救：从黑暗中恢复自我",
            "desc": [
                "{第1章：黑暗笼罩：在与邪念波的战斗中，你不幸被邪恶侵蚀，你的内心陷入了黑暗，你开始寻找从黑暗中走出的道路。}",
                "{第2章：自我对抗：你深陷黑暗，对邪念产生恐惧与自我怀疑。你挣扎在自我与邪念之间，你试图找到控制自我的力量，但影子越来越近。矛盾和冲突让你的局势变得越来越糟糕。}",
                "{第3章：摆脱束缚：你在这场内心的斗争中找到了破局的方法，却发现越是挣扎，黑暗的力量越强。那时出现了转折点，你选择了接受黑暗，试图理解它，以此摆脱邪念的束缚。}",
                "{第4章：光明拂破黑暗：你开始用更强大的意志力与邪念抗争，一个顿悟引导你理解了与黑暗共存的可能。你鼓起勇气，让你的内心光明凌驾黑暗，与自我相连，再次点燃希望的火花。}",
                "{第5章：最后的挣扎：邪念发起了最后的冲击，你知道这是决定性的战斗。你用自己的意志力和黑暗交织，用坚韧和信念护佑自己，你接受了挑战，尽全力对抗邪念。}",
                "{第6章：崭新的阳光：你成功抵御了邪念的侵袭，虽然过程充满了挫折，更有恐惧和痛苦的挣扎，但你最终走出了黑暗。虽有摇摇晃晃，但你依然站立，胜利的阳光终究照亮了你的道路。}",
                "胜利结束语：“恭喜你，孙悟空，你从黑暗的深渊中成功走出，你用你的决心和勇气克服了最艰难的挑战，胜利得到了最好的回报。你的冒险将会成为传奇，赞美你，在每一次的挑战中，你都表现出无尽的勇气和智慧。”",
                "失败结束语：“勇敢的孙悟空，虽然结果并不尽如人意，但你的精神和决心令人钦佩。黑暗尽管可怕，但你的明亮内心永远不会被它熄灭。你的战斗不会结束，我们将会继续为你加油，相信你最终会战胜挑战。”"
            ],
            "bonus": 2182.4366540196497,
            "goal": 6,
            "cost": 600.0,
            "progress": 4,
            "start_time": "2024-03-12T21:33:07.577391",
            "duration": 200.0,
            "failed": true
        },
        {
            "name": "纷争，牺牲与救赎：自我挽救之旅",
            "desc": [
                "{第1章：邪念入侵：你的身体被邪念吞噬，你的精神陷入混乱，心中充满痛苦与悔恨。你情不自禁地攻击了唐僧，使他受伤，你的内心受到极大的冲击。}",
                "{第2章：自我毁灭：你沉浸在自我痛苦中，邪念主导了你的想法。你看着无辜的紫霞仙子站在你面前，她尝试唤醒你的人性，你却在邪念的控制下对她发起无情的攻击。}",
                "{第3章：绝望之剑：你手持武器，却刺向了紫霞仙子。她用生命换取你的清醒，你感受到了她在你怀中消逝的一刻，那是你生命中最深的遗憾和痛苦。这份痛苦逐渐破碎了你的冰冷外壳，你开始认识到自我与邪念的界限。}",
                "{第4章：觉醒的悲痛：你的内心被悲痛和愧疚撕裂，这是你人生的转折点。你在痛定思痛中开始觉醒，你决定挣脱黑暗，寻找一线生机。这份痛苦使你变得更强，你决定以紫霞仙子的牺牲为动力，开始自我救赎的旅程。}",
                "{第5章：重获新生：你开始面对自己的罪过，并努力找到赎罪的道路。你旨在向紫霞仙子证明，她的牺牲并非徒劳，你以磨难为动力，希望引领内心魔从黑暗中走出。}",
                "{第6章：救赎之路：逐渐清醒的你面对邪念的重重试炼，你在悲痛中寻找救赎，你决定战胜自我，为了紫霞、为了唐僧，为了自己，你终将胜利出现在你的视线中。}",
                "胜利结束语：“孙悟空，恭喜你在面临重重困难之后，最终找到了救赎之路。你展现出的坚韧意志和决心，使你在痛苦与困惑中崭新的自我，你的执着和毅力应得到最高的赞扬。”",
                "失败结束语：“孙悟空，尽管现在的局势极其艰难，你还未能完全从黑暗中走出，但你所展现出的决心和努力都给你铸造了可能的未来。你需要继续克服挑战，向前推进，我们深信，你的救赎之路将会实现。”"
            ],
            "bonus": 1557.2304580505095,
            "goal": 6,
            "cost": 600.0,
            "progress": 3,
            "start_time": "2024-03-13T13:28:00",
            "duration": 200.0,
            "failed": true
        },
        {
            "name": "堕落与觉醒：迎接内在挑战",
            "desc": [
                "{第1章：邪念的诱惑：你被邪念笼罩，一种黑暗的力量正在侵蚀你的心灵。紫霞仙子牺牲自己试图唤醒你，却无法阻止你的堕落。你在痛苦和悲伤中，不断被黑暗侵蚀。}",
                "{第2章：自我挣扎：你在黑暗中挣扎，你的内心充满矛盾。你对自己的行为感到愧疚和疑惑，紫霞的牺牲让你清醒，你开始努力寻找自我。}",
                "{第3章：心魔的战斗：你开始面临内心的挑战，你的心魔化为具象，一一出现。你必须对抗这些心魔，解开你内心的锁链，只有战胜它们，你才能真正找到自我。}",
                "{第4章：自我觉醒与新生：在一连串的困难和挑战中，你逐渐明白了自我，你用你的勇气和意志力成功克服了心魔的束缚，走向新生。你找回了自己，成功从邪念的束缚中解脱出来。}",
                "胜利结束语：“你做到了，孙悟空！你从内心的深渊中爬了出来，你在黑暗中找到了自我。你的决心和毅力粉碎了心魔，向世界展示真我。你为自己的成长和醒悟而战，你的胜利，是自我救赎的胜利。”",
                "失败结束语：“孙悟空，你的挑战还未结束，你还未完全摆脱邪念的束缚。但请相信你自己，只要有决心和意志力，一定可以克服心魔，找回真正的自我。请不要放弃，你的成功就在前方。”"
            ],
            "bonus": 1197.956053103963,
            "goal": 4,
            "cost": 400.0,
            "progress": 3,
            "start_time": "2024-03-13T17:11:43.286291",
            "duration": 135.0,
            "failed": true
        },
        {
            "name": "迷途之路：面对过去，走进未来",
            "desc": [
                "{第1章：再次堕落：邪念再度侵蚀你的思绪，你在痛苦和混乱中再次犯下罪行，你的行为深深刺伤了你的心灵。你不断地挣扎和煎熬，试图从黑暗中走出。}",
                "{第2章：过去的影子：在黑暗中，你看到了过去的自己。那个纯真无邪，充满活力的孙悟空，他的出现像一把双刃剑，既让你产生了痛苦的悔恨，也让你看到了希望的曙光。}",
                "{第3章：亡魂的责难：突然，死去的沙师弟的亡魂出现在你面前。他责问你的行为，将你引向更深的痛苦。然而，他的责难最终转化为力量，引发你的觉醒。}",
                "{第4章：战胜心魔：你的内心经过了一场惊心动魄的较量，你用勇气和坚毅战胜了心魔。你握紧拳头，挺直了胸膛，决定走出黑暗，迎接新的生命。}",
                "胜利结束语：“孙悟空，你在黑暗的深渊中找到了那一抹光明，你用对过去的反思和悔悟，挺过了黑暗的低谷。你的坚持和决心，使你在面对最困难的挑战时获得了胜利。”",
                "失败结束语：“孙悟空，你的挑战还没有结束。即使现在的道路充满荆棘，但只要你有决心，就一定能如愿以偿。请你继续前行，我们相信你一定能找到光明。”"
            ],
            "bonus": 1664.7846193575638,
            "goal": 4,
            "cost": 400.0,
            "progress": 3,
            "start_time": "2024-03-15T16:10:44.803153",
            "duration": 148.0,
            "failed": true
        },
        {
            "name": "最后的抗争：从绝望中找到希望",
            "desc": [
                "{第1章：心魔的势不可挡：心魔的力量越来越强，你被打倒在地，看似即将被它彻底打败。你在地上挣扎，尽力想站起来，但体力和意志似乎都在极速耗尽，你感到了从未有过的绝望和无力。}",
                "{第2章：真我的觉醒：然而，就在这关键的时刻，你放下了邪念，忽略了外界带来的焦虑，将目光聚焦在自我身上。你开始理解自己的身体，感受自己存在的气息，以对当下的切身判断和微行为的理念掌控身体。此刻，你发出了菩提心，攻击心魔。}",
                "胜利结束语：“孙悟空，你做到了！你成功地反击，击败了心魔，从即将把你打倒的那个深渊爬了出来。你的挣扎、毅力和决心都值得我们尊敬！你终于从黑暗中找到了出路，用最后的力气，将战斗带向了胜利的彼岸。”",
                "失败结束语：“孙悟空，现在看来，你还有一段漫长的道路要走。心魔的力量仍在侵蚀你，但是，你已经开始了了解自己的旅程，你必将走出黑暗，找回自己。我们期待看到你新的一天。”"
            ],
            "bonus": 540.6796853770516,
            "goal": 2,
            "cost": 200.0,
            "progress": 2,
            "start_time": "2024-03-15T19:44:58.453613",
            "duration": 65.0,
            "failed": false
        }
    ]
}