{
    "active": [
        {
            "name": "223",
            "desc": [
                "1",
                "1"
            ],
            "bonus": 891.3532775668912,
            "goal": 4,
            "cost": 300.0,
            "progress": 0,
            "start_time": "2024-03-07T22:00:00",
            "duration": 150.0,
            "failed": false
        }
    ],
    "finished": [
        {
            "name": "1",
            "desc": "1",
            "bonus": 45.0,
            "goal": 1,
            "cost": 10.0,
            "progress": 1,
            "start_time": "2023-12-26T19:44:29.877910",
            "duration": 1.0,
            "failed": true
        },
        {
            "name": "19点前 la算法x2番",
            "desc": "第一个挑战",
            "bonus": 322.10827868441703,
            "goal": 2,
            "cost": 60.0,
            "progress": 1,
            "start_time": "2024-02-04T18:20:00.293437",
            "duration": 1.0,
            "failed": true
        },
        {
            "name": "勇士的试炼",
            "desc": "A randomly generated challenge.",
            "bonus": 70.36328806315504,
            "goal": 2,
            "cost": 40.0,
            "progress": 0,
            "start_time": "2024-02-27T13:24:38.688065",
            "duration": 2.034452725444008,
            "failed": true
        },
        {
            "name": "追债计划",
            "desc": "将收益快速赚为正数",
            "bonus": 256.84951231003845,
            "goal": 4,
            "cost": 100.0,
            "progress": 4,
            "start_time": "2024-02-27T16:12:57.073448",
            "duration": 2.5,
            "failed": false
        },
        {
            "name": "两番茄速成",
            "desc": "",
            "bonus": 328.593609458054,
            "goal": 2,
            "cost": 100.0,
            "progress": 2,
            "start_time": "2024-02-27T19:04:21.518915",
            "duration": 1.0,
            "failed": false
        },
        {
            "name": "2.28面前冲刺",
            "desc": "冲鸭",
            "bonus": 405.6718485261867,
            "goal": 2,
            "cost": 100.0,
            "progress": 1,
            "start_time": "2024-02-28T12:05:15.058756",
            "duration": 1.0,
            "failed": true
        },
        {
            "name": "梁山大劫",
            "desc": "任务描述：你作为阮小二，从村民口中得知严家庄的镖车将要送去梁山的珍贵物资，恰好梁山正需要这些物资以抵御未来可能的攻击。你的任务是获取镖车行进路线的详细信息，制定一个完美的抢劫计划。",
            "bonus": 859.7067569778739,
            "goal": 4,
            "cost": 200.0,
            "progress": 2,
            "start_time": "2024-02-28T15:03:23.258659",
            "duration": 2.0,
            "failed": true
        },
        {
            "name": "拜师之路：孙悟空的挑战",
            "desc": [
                "{第1章：野心的觉醒： 遗落在花果山的孙悟空，通过与山中诸兽的交锋，逐渐觉醒了学艺的野心和对外界的好奇。他决定开始寻找能够指导他的师父。探索湖泊，山脉，野生动物和人类的住所，收集线索，找到一条通往大师的道路。}",
                "{第2章：长途跋涉： 孙悟空跋山涉水，通过锁定地点，战胜怪兽，解谜，最终找到一条通向高山洞穴的道路，并坚信那里定有他要找的人。在这个章节中，孙悟空需要克服各种困难，保护自己，同时积累经验，提高自己的实力。}",
                "{第3章：智斗猴王： 高山洞穴的主人——猴王不轻易收徒，他设置了一系列的挑战等待着孙悟空。孙悟空需要通过智谋和力量，逐一击败猴王的挑战，证明自己有成为他弟子的资格。这是一个测试玩家战斗策略和解谜能力的好机会。}",
                "{第4章：终极考验： 孙悟空成功挑战了猴王，但最后的考验还未结束。猴王让悟空寻找一种神奇的草药，这种草药的位置只有通过解读一篇古老的卷轴才能找到。孙悟空需要利用他的智慧和力量，找到这种草药，才能最终成为猴王的弟子。}",
                "结束语：恭喜你完成了所有任务，孙悟空终于成为猴王的弟子，开始了他的弟子生涯。这只是孙悟空的冒险旅程的开始，他将在猴王的指导下，逐渐成长为一名真正的英雄。"
            ],
            "bonus": 763.9558858639059,
            "goal": 4,
            "cost": 200.0,
            "progress": 4,
            "start_time": "2024-02-29T17:11:29.629872",
            "duration": 2.1,
            "failed": false
        },
        {
            "name": "道法自然：孙悟空的习艺之旅",
            "desc": [
                "{第1章：寻找菩提老祖：在猴王的启发下，孙悟空想要学习更多的知识和技能，他听闻东胜神洲有一位高人菩提老祖，知道许多神奇的道法。孙悟空踏上寻找菩提老祖的旅程，经历千辛万苦，终于找到了菩提老祖的住处。}",
                "{第2章：菩提老祖的试炼：菩提老祖并不轻易收徒，孙悟空想要成为他的弟子，需要通过一连串的试炼笔试以及实战测试，证明自己有足够的天赋和恒心。章节中，玩家将帮助孙悟空通过各种形式的挑战，不断突破自己，拨开迷雾，找到前行的路标。}",
                "{第3章：学习72变：孙悟空成功打动了菩提老祖，被接纳为弟子，开始学习72变的道法。每一变都需要孙悟空克服不同的困难，找到解决问题的策略，你将在这个过程中，帮助孙悟空将这门深奥的道法学到了心中。}",
                "{第4章：猎妖之战：在学习完72变后，孙悟空被菩提老祖派去斩妖降魔，以此来证明自己的实力和成长。在这个章节中，孙悟空将遇到各种凶猛的妖怪，你需要用你刚刚学到的技能，帮助孙悟空完成任务，证明自己的价值。}",
                "结束语：恭喜你成功完成了所有的任务，孙悟空经过一段长时间的磨砺，他已经掌握了72变的各种技巧，他将带着这些技巧，继续他的传奇旅程。你的帮助让他在这个过程中变得更加强大，“道法自然”不再是一个空洞的名词，而是他用行动实现的信仰。"
            ],
            "bonus": 601.2945045362295,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-01T12:43:56.006498",
            "duration": 2.0,
            "failed": true
        },
        {
            "name": "从大闹天宫到五花山，孙悟空的挑战",
            "desc": [
                "{第1章：大闹天宫：在这一章节中，您将扮演孙悟空，大闹天宫，与天兵天将进行激战。你需要通过策略和技巧，来对抗大量的敌人，并取得胜利。}",
                "{第2章：入佛教之门：在收朝天兵天将之后，你需要扮演孙悟空求佛入道。这会涉及到与观世音菩萨和如来佛祖的对话，并使他们相信你的忠诚。}",
                "{第3章：被罚下界：在这部分任务里，你的行为引发了如来佛祖的不满，你需要尝试逃脱，但无论你做什么，剧情最后都会被罚到人间。}",
                "{第4章：五花山困难：陷入困境后，你作为孙悟空需要尽可能长时间地在五花山挺过去。你需要利用你的技能和资源在这个环境中生存，直到被唐僧解救。}",
                "胜利结束语：恭喜你，琢磨出如来佛祖的试炼，孙悟空在挑战中无所畏惧，展示出了他的无畏和勇敢。你现在已经准备好了开始西游记的大冒险。",
                "失败结束语：你没有成功完成孙悟空的挑战。无论你现在是否感到沮丧，记住不要放弃。因为每一个困难只会使你变得更加强大。请再次尝试，并用你的能力克服每一个挑战。你就是孙悟空，你有能力做到。"
            ],
            "bonus": 643.3613505657023,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-01T15:46:48.156013",
            "duration": 2.1,
            "failed": true
        },
        {
            "name": "揭秘阎王的阴谋",
            "desc": [
                "{第1章：下地府：作为孙悟空，你在上一个任务失败后被贬到了地府。在这一章里，你需要尽快适应这个陌生的环境，并寻找信息，以了解这个新的挑战。}",
                "{第2章：发现阴谋：在这个章节中，你要调查阎王的计划，探寻他的阴谋力量。你需要小心地搜集线索，并通过智谋和策略找到隐藏的真相。}",
                "{第3章：揭露阎王：在最后一章节，你需要针对阎王阴谋的证据，将阎王的阴谋公之于众，并挫败他的计划。好好利用你的智慧和力量，以防止阎王对地府的进一步损害。}",
                "胜利结束语：恭喜你成功揭秘了阎王的阴谋并挫败了他的计划。你的勇气和智慧展示出真正的英雄。孙悟空再次彰显出他的无畏精神和聪明才智。",
                "失败结束语：虽然你未能揭秘阎王的阴谋，但是请别灰心。记住，我们通过失败学习，通过挑战变得更强。重新来过吧，你有慧眼识破一切，有力量征服一切，你就是孙悟空。再次挑战这个剧情任务，期待你的胜利！"
            ],
            "bonus": 621.1224069325889,
            "goal": 3,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-01T18:38:47.683990",
            "duration": 1.5,
            "failed": false
        },
        {
            "name": "召回人间，孙悟空的唐僧招募之旅",
            "desc": [
                "{第1章：召回人间：你成功揭秘了阎王的阴谋并被召回到人间。作为孙悟空，你需要快速适应重新回到世界，并开始你的新旅程。}",
                "{第2章：寻找唐僧：在这个章节中，你需要找到即将出山的唐僧。利用你的聪明才智和力量，通过询问当地居民，解决谜题，并避开遇到的陷阱来寻找他。}",
                "{第3章：请唐僧出山：在此章节，你需要说服唐僧和他的徒弟们出山，开始新的冒险。展现你的智慧和说服力，让他们相信你，为接下来的取经之旅做准备。}",
                "{第4章：开始取经旅行：唐僧同意出山后，你需要为西天取经之旅做好准备。收集必要的物品，且要确保全队人员的状态良好，预备迎接可能遇到的一切困难。}",
                "胜利结束语：恭喜你成功的找到了唐僧并开始了西天取经的旅行，孙悟空的冒险又进入了新的篇章。等待您的，将是更多未知的挑战，艰难的试炼，以及无尽的冒险。期待你在未来的旅程中继续展现智慧和勇气。",
                "失败结束语：你没能成功说服唐僧出山或者开始取经的旅行，但别气馁，失败总是成功之母。你是孙悟空，你从不知道怎么样是放弃。让我们再次挑战这个剧情任务，期待你的胜利！"
            ],
            "bonus": 766.8099217183552,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-02T17:16:32.482146",
            "duration": 2.1,
            "failed": true
        },
        {
            "name": "唤醒唐僧，孙悟空的不按常规出牌之计",
            "desc": [
                "{第1章：寻找唐僧：你作为孙悟空，虽然未能成功说服唐僧出山，但你决定了新的行动方案。你需要锲而不舍的寻找唐僧，在找到他的同时要避免引起过多的注意，以防敌人知道你的计划。}",
                "{第2章：逼迫唐僧出山：无法通过普通方法说服唐僧，你决定用武力逼迫唐僧出山。你要威慑大僧出山，并以力量保证他的安全，同时你要确保你的力量不会伤及无辜。}",
                "胜利结束语：恭喜你用武力成功的逼迫唐僧出山并开启新的旅程。虽然这个决定有些冒险，但你的勇气和决心向我们展示了一个不同于以往的孙悟空。",
                "失败结束语：这次尝试未能成功，你的力量或许过大，或者你的策略有待改进。记住，孙悟空从未怕过失败。让我们再次尝试这个任务，期待你的胜利！"
            ],
            "bonus": 409.646675432181,
            "goal": 2,
            "cost": 100.0,
            "progress": 2,
            "start_time": "2024-03-02T19:56:44.080964",
            "duration": 1.0,
            "failed": false
        },
        {
            "name": "绝地归来，唐僧师徒的收复八戒之旅",
            "desc": [
                "{第1章：唐僧出山：经过了前期的决斗，你成功地逼出了唐僧，并开始了新的西天取经之旅。你需要确保唐僧的安全，同时积极寻找其他合适的人选加入你们的行列。}",
                "{第2章：寻找八戒：在这一章节中，你得知八戒可能在附近，你需要从当地居民那里获取线索，根据线索搜寻八戒，以便重建你们的团队。}",
                "{第3章：战斗与劝说：找到八戒后，你发现他已经被妖怪控制，为了收复他，你需要展现出你的武力，并在深入的战斗中救出八戒。战斗结束后，需要用你的智慧说服他重新加入你们的队伍。}",
                "{第4章：重组团队：在收复八戒后，你们就准备继续取经之旅。这一章节需要你确保唐僧师徒的状态良好，处理可能出现的问题，并最终准备好继续前行。此时的队伍已经变得更加强大，将面临新的挑战。}",
                "胜利结束语：恭喜你成功收复了八戒，你的队伍变得更强大，这标志着你们的取经之路已经迈出了新的一步。接下来的旅程中，相信你们会面对更多的挑战，期待你们一步步克服困难，成功完成取经之旅！",
                "失败结束语：哎呀，看来这次你没有成功收复八戒。但别担心，失败并不可怕，孙悟空从不知道滑倒两次，三次是什么感觉。让我们再次尝试这个任务，期待你的胜利！"
            ],
            "bonus": 748.3688735537712,
            "goal": 4,
            "cost": 200.0,
            "progress": 4,
            "start_time": "2024-03-05T14:18:12.688989",
            "duration": 2.2,
            "failed": false
        },
        {
            "name": "流沙纵横，唐僧师徒收复沙僧之旅",
            "desc": [
                "{第1章：继续取经旅行：你作为孙悟空，和唐僧以及猪八戒成功重组队伍后，你们决定继续西天取经之旅，大家精神饱满，充满了希望和信心。}",
                "{第2章：发现流沙河：在你们的旅行过程中，发现了一片流沙河，而沙河中似乎隐藏着某种未知的力量。在这一章节中，你需要发挥聪明才智以观察和了解这股力量。}",
                "{第3章：战斗并收复沙僧：在流沙河中，你遇见了沙僧。你需要通过智勇双全的战斗迫使他屈服，并最终说服他加入你们的团队。}",
                "{第4章：继续取经：在成功收复沙僧后，你们的队伍再度壮大。这一章节，你需要保护好队伍的每一个成员，处理可能出现的问题，并做好准备继续西天取经之旅。}",
                "胜利结束语：恭喜你成功收复了沙僧，你的取经队伍已经成型，期待你们团结一致，共同面对接下来的挑战，完成取经之旅！",
                "失败结束语：哦，看来这次收复沙僧的尝试并未成功，但请记住，失败是成功之母。你是孙悟空，你懂得如何从挫折中站起来。让我们再尝试一次，期待你下一次的胜利！"
            ],
            "bonus": 725.2548691829818,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-05T17:17:10.097891",
            "duration": 2.2,
            "failed": true
        },
        {
            "name": "险象环生，唐僧师徒与魔化沙僧的决战",
            "desc": [
                "{第1章：发现魔化沙僧：你作为孙悟空，正在与师兄弟们踏上取经之旅。在旅行的途中，你发现沙僧的举动突然变得古怪，他的样貌也开始变化。你必须查明原因，并挖掘真相。}",
                "{第2章：了解妖魔化过程：你积极寻找线索，了解沙僧被妖魔化的原因，同时你还要防止他的行径对取经之旅产生更大的影响。 }",
                "{第3章：决战魔化沙僧：你决定要结束沙僧的妖魔化状态。你必须用你的智慧与实力与魔化的沙僧展开决战，并最终将其打入轮回地狱。}",
                "{第4章：重启取经：在成功击败魔化沙僧后，你需要处理队伍中的其他问题，并准备好再一次出发，继续你们的西天取经之旅。}",
                "胜利结束语：恭喜你成功击败了魔化的沙僧，并将其打入轮回地狱。你的勇气和智慧务必能帮助你们在未来的旅程中再次度过难关。期待你们下一步的成功！",
                "失败结束语：哎，看来这次你并未能成功逐退魔化的沙僧。但是，请别气馁。失败也是一个学习的过程，让我们从中吸取教训，再次挑战。孙悟空，你是我们最强大的战士，你一定能胜利！"
            ],
            "bonus": 899.1461219933434,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-06T13:48:33.183186",
            "duration": 2.1666666666666665,
            "failed": true
        },
        {
            "name": "复仇之战，归来的沙僧与花果山之战",
            "desc": [
                "{第1章：沙僧的变化：在你们的取经之旅中，时隔多日，你再次遇见了沙僧，他的眼神充满了怒火，表现出强烈的恶意。你需要找出他行为突变的原因，并尽快解决。}",
                "{第2章：发现真相：你了解到沙僧已经决定去花果山复仇。你需要收集信息，找到他的下一步行动，并且想办法阻止他的复仇计划。}",
                "{第3章：与沙僧的决战：你必须面对沙僧，他已经步入了复仇的道路并决心实现其目的。所以，你必须用你所有的力量与他展开一场决战，阻止他的复仇行动。}",
                "{第4章：再次起航：在成功阻止沙僧的复仇行动后，你需要处理队伍中的其他问题，准备好再一次出发，继续取经之旅。}",
                "胜利结束语：恭喜你成功阻止了沙僧的复仇行动，让花果山免于一场大劫。你的智勇使你对未来的困难有了更多的信心。让我们继续目标，期待你们的取经之旅更多的成功！",
                "失败结束语：很遗憾，你没有成功阻止沙僧，他的复仇带来了大祸。但是请不要放弃，失败只是暂时的。请集中精力，重新来过，用你的勇气和智慧去正面面对这一切。孙悟空，你是强者，你一定可以的！"
            ],
            "bonus": 667.7569317038766,
            "goal": 4,
            "cost": 200.0,
            "progress": 3,
            "start_time": "2024-03-06T16:36:08.050358",
            "duration": 2.1666666666666665,
            "failed": true
        },
        {
            "name": "从灰烬中崛起，花果山的灾难与沙僧的封印",
            "desc": [
                "{第1章：目睹灾难：你作为孙悟空，回到被毁灭的花果山，你需要在混乱中找出导致灾难的真相，同时保护好自己和猪八戒。}",
                "{第2章：追踪沙僧：发现沙僧是此次灾难的始作俑者后，你决定展开追踪，查明他的下一步行动，并寻找封印他的方法。}",
                "{第3章：制服沙僧：和猪八戒合力，你们需要联手击败失控的沙僧。你们必须运用各自的能力制服他，阻止他的破坏行动。}",
                "{第4章：封印沙僧：你们成功制服沙僧后，需要找到一种方法将他封印起来，以防止他再次引发灾难。封印沙僧后，你们可以开始计划重建花果山。}",
                "胜利结束语：恭喜你们成功制服并封印了沙僧，等待你们的将是重建家园的艰巨任务。你们通过这场灾难看清了真相，用勇气和智慧应对困难。期待你们在重建家园的道路上获得更大的成功！",
                "失败结束语：哦，这次封印沙僧的计划失败了，恐怕你们还需要面对更多的困难。但是，请不要绝望，无论前方的路多么艰难，你们都有面对它的勇气和智慧。失败只会让你更加坚强，正视失败，并从中吸取教训，重整旗鼓，再接再厉，你们一定可以！"
            ],
            "bonus": 955.0059504302703,
            "goal": 3,
            "cost": 200.0,
            "progress": 0,
            "start_time": "2024-03-06T23:00:00",
            "duration": 1.5,
            "failed": true
        },
        {
            "name": "为正义而战，观音菩萨援手收服沙僧",
            "desc": [
                "{第1章：邪恶的觉醒：你作为孙悟空，亲眼看到沙僧变得更加强大，他的邪恶气息让你们深感无力。你们需要迅速变得更强，挺身对抗邪恶。}",
                "{第2章：寻求援助：知道你们联手也无法与沙僧抗衡，你决定寻求观音菩萨的援助。你需要越过各种阻碍，才能找到观音菩萨，并向她说明情况。}",
                "{第3章：联合观音菩萨：在观音菩萨的援助下，你们需要与沙僧展开又一轮决战。你们需要全力以赴，才有可能将他压制。}",
                "{第4章：收服沙僧：在观音菩萨的帮助下成功地压制住了沙僧，而接下来你们需要寻找方法，收服他，使他回归正道，以防止他再次掀起波澜。}",
                "胜利结束语：恭喜你们！在观音菩萨的帮助下成功收服了沙僧，将这场可能带来更大灾难的风波平息下来。这个挑战无疑是重重难关中的一大步，你们的勇气和智慧将是你们对抗任何难题的利器。期待你们在取经之路上取得更多的成功！",
                "失败结束语：遗憾的是，你们并未能成功收服沙僧，他仍然在制造更多的混乱和破坏。但请不要绝望，你们仍然有机会重新挑战他。失败只是成功的垫脚石，你们将再次挺身而出，以你们的智慧和勇气去收服他，你们一定可以做到！加油！"
            ],
            "bonus": 1120.9573485558635,
            "goal": 4,
            "cost": 300.0,
            "progress": 4,
            "start_time": "2024-03-07T10:40:00",
            "duration": 140,
            "failed": false
        },
        {
            "name": "重建家园，蓝翔援手花果山",
            "desc": [
                "{第1章：在复仇风暴中的胜利：在与沙僧的决战结束后，你成功阻止了他的复仇行动，花果山虽然遭遇了损失，但你赢得了胜利。这一章是庆祝这个伟大胜利的时刻，你需要激励你的队伍，并确定下一步行动。}",
                "{第2章：确定重建之路：面对花果山的重建问题，你决定寻求蓝翔帮助。这一章，你需要了解和确定寻求帮助的策略，并准备好向蓝翔发出请求。}",
                "{第3章：走向蓝翔：你走向蓝翔，用你所有的说服力去请求他们的帮助。这一章，你需要面对可能的问题，解决他们对你的疑虑，并拉近与他们的关系。}",
                "{第4章：成功的喜讯：你成功地说服了蓝翔，他们决定帮助花果山重建。这是庆祝的时刻，你需要传达这个好消息，并策划一次庆祝活动。}",
                "胜利结束语：恭喜你，你成功的说服了蓝翔，现在他们将帮助花果山的重建。你的智慧和决心在这次挑战中得到了体现，期待你在未来的任务中取得更多的成功。让我们共同参加庆祝活动，欢庆花果山的新生！",
                "失败结束语：这次你并没有成功地说服蓝翔，但请不要失望。每个挑战都是一个学习的机会。通过这次经历，你更清楚如何改善你的策略。面对挑战，孙悟空，你总是可以以你无人能敌的决心和勇气去击败困难，期待你的精彩的表现！"
            ],
            "bonus": 969.7704177200569,
            "goal": 4,
            "cost": 300.0,
            "progress": 4,
            "start_time": "2024-03-07T15:06:29.593835",
            "duration": 137.0,
            "failed": false
        },
        {
            "name": "新友同行，白龙马的归来",
            "desc": [
                "{第1章：狂欢过后：在成功地寻求到蓝翔的帮助并庆祝过后，你和你的队伍处于一个欢乐而短暂的狂欢之中。然而，你们知道你们还需要继续旅程，因此你们开始为下一次的行程做准备。}",
                "{第2章：迎接新挑战：你们决定找到一只坐骑，为唐僧的旅程提供便利。你们的目标是神奇的白龙马。为了这一个目标，你们必须策划并执行一次捕获白龙马的任务。}",
                "{第3章：与白龙马的交流：你们找到了白龙马，但是不是所有的事情都如预期的那样顺利。你们需要和白龙马进行交流，承认你们的目的，并尽力说服它和你们同行。}",
                "{第4章：新的起点：你们成功地说服了白龙马，和它建立起了深厚的友谊。现在，有了这个新的伙伴，你们再度出发，准备应对下一次的挑战。}",
                "胜利结束语：恭喜你，孙悟空！你成功地说服了白龙马成为你们的新伙伴。这只增加了你们取经队伍的实力。有了白龙马的帮助，你们将能更快地完成任务。我们期待你们在未来的旅程中取得更多的胜利。",
                "失败结束语：你并没有成功说服白龙马加入你们的队伍，但这并不重要。失败只是成功的教父，你一定能从这次经历中找到成功的线索。相信你自己，孙悟空，你一定能找到自己的道路。让我们一起为你的下一次成功尝试欢呼！"
            ],
            "bonus": 858.2936636466493,
            "goal": 4,
            "cost": 300.0,
            "progress": 3,
            "start_time": "2024-03-07T18:40:35.497850",
            "duration": 130.0,
            "failed": true
        }
    ]
}